simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
static GpioScanSlot g_rx_scan[] = {
    {4, 0, 0}, {5, 0, 0}, {12, 0, 0}, {13, 0, 0}, {14, 0, 0},
    {18, 0, 0}, {19, 0, 0}, {21, 0, 0}, {22, 0, 0},
    {25, 0, 0}, {27, 0, 0}, {32, 0, 0}, {33, 0, 0},
};

static void IRAM_ATTR onRxScan0()  { g_rx_scan[0].edges++;  g_rx_scan[0].level  = (uint8_t)digitalRead(g_rx_scan[0].pin); }
static void IRAM_ATTR onRxScan1()  { g_rx_scan[1].edges++;  g_rx_scan[1].level  = (uint8_t)digitalRead(g_rx_scan[1].pin); }
static void IRAM_ATTR onRxScan2()  { g_rx_scan[2].edges++;  g_rx_scan[2].level  = (uint8_t)digitalRead(g_rx_scan[2].pin); }
static void IRAM_ATTR onRxScan3()  { g_rx_scan[3].edges++;  g_rx_scan[3].level  = (uint8_t)digitalRead(g_rx_scan[3].pin); }
static void IRAM_ATTR onRxScan4()  { g_rx_scan[4].edges++;  g_rx_scan[4].level  = (uint8_t)digitalRead(g_rx_scan[4].pin); }
static void IRAM_ATTR onRxScan5()  { g_rx_scan[5].edges++;  g_rx_scan[5].level  = (uint8_t)digitalRead(g_rx_scan[5].pin); }
static void IRAM_ATTR onRxScan6()  { g_rx_scan[6].edges++;  g_rx_scan[6].level  = (uint8_t)digitalRead(g_rx_scan[6].pin); }
static void IRAM_ATTR onRxScan7()  { g_rx_scan[7].edges++;  g_rx_scan[7].level  = (uint8_t)digitalRead(g_rx_scan[7].pin); }
static void IRAM_ATTR onRxScan8()  { g_rx_scan[8].edges++;  g_rx_scan[8].level  = (uint8_t)digitalRead(g_rx_scan[8].pin); }
static void IRAM_ATTR onRxScan9()  { g_rx_scan[9].edges++;  g_rx_scan[9].level  = (uint8_t)digitalRead(g_rx_scan[9].pin); }
static void IRAM_ATTR onRxScan10() { g_rx_scan[10].edges++; g_rx_scan[10].level = (uint8_t)digitalRead(g_rx_scan[10].pin); }
static void IRAM_ATTR onRxScan11() { g_rx_scan[11].edges++; g_rx_scan[11].level = (uint8_t)digitalRead(g_rx_scan[11].pin); }
static void IRAM_ATTR onRxScan12() { g_rx_scan[12].edges++; g_rx_scan[12].level = (uint8_t)digitalRead(g_rx_scan[12].pin); }

static void (* const g_rx_scan_isr[])(void) = {
    onRxScan0, onRxScan1, onRxScan2, onRxScan3, onRxScan4,
    onRxScan5, onRxScan6, onRxScan7, onRxScan8, onRxScan9,
    onRxScan10, onRxScan11, onRxScan12,
};

static bool rxScanIsReservedPin(uint8_t pin)
{
    return pin == (uint8_t)PSOC_UART_RX ||
           pin == (uint8_t)PSOC_UART_TX ||
           pin == (uint8_t)SYNC_TO_PSOC_PIN ||
           pin == (uint8_t)SYNC_IN_PIN ||
           pin == (uint8_t)DEBUG_HW_START_PIN;
}

static void beginPsocRxScan()
{
    for (size_t i = 0; i < (sizeof(g_rx_scan) / sizeof(g_rx_scan[0])); i++) {
        const uint8_t pin = g_rx_scan[i].pin;
        if (rxScanIsReservedPin(pin)) {
            continue;
        }
        pinMode(pin, INPUT_PULLUP);
        g_rx_scan[i].level = (uint8_t)digitalRead(pin);
        attachInterrupt(digitalPinToInterrupt(pin), g_rx_scan_isr[i], CHANGE);
    }
    SLAVE_LOG_PRINTLN("[SLAVE] RX_SCAN enabled");
}

static void logPsocRxScan()
{
    uint32_t edges[sizeof(g_rx_scan) / sizeof(g_rx_scan[0])];
    uint8_t levels[sizeof(g_rx_scan) / sizeof(g_rx_scan[0])];

    noInterrupts();
    for (size_t i = 0; i < (sizeof(g_rx_scan) / sizeof(g_rx_scan[0])); i++) {
        edges[i] = g_rx_scan[i].edges;
        levels[i] = g_rx_scan[i].level;
    }
    interrupts();

    SLAVE_LOG_PRINTF(
        "[SLAVE] RX_SCAN p4=%lu/%u p5=%lu/%u p12=%lu/%u p13=%lu/%u p14=%lu/%u "
        "p18=%lu/%u p19=%lu/%u p21=%lu/%u p22=%lu/%u p25=%lu/%u p27=%lu/%u p32=%lu/%u p33=%lu/%u\n",
        (unsigned long)edges[0], (unsigned)levels[0],
        (unsigned long)edges[1], (unsigned)levels[1],
        (unsigned long)edges[2], (unsigned)levels[2],
        (unsigned long)edges[3], (unsigned)levels[3],
        (unsigned long)edges[4], (unsigned)levels[4],
        (unsigned long)edges[5], (unsigned)levels[5],
        (unsigned long)edges[6], (unsigned)levels[6],
        (unsigned long)edges[7], (unsigned)levels[7],
        (unsigned long)edges[8], (unsigned)levels[8],
        (unsigned long)edges[9], (unsigned)levels[9],
        (unsigned long)edges[10], (unsigned)levels[10],
        (unsigned long)edges[11], (unsigned)levels[11],
        (unsigned long)edges[12], (unsigned)levels[12]);
}
#endif

/* ── Objetos ─────────────────────────────────────────────────────────────── */
static PsocUART       psoc;
static EspNowTransport transport;

/* Helpers de pulsos GPIO de osciloscopio (módulo aparte). */
#include "scope_pulse.h"

static void sendCfgAck(uint8_t sub_cmd, uint8_t ok);

static void IRAM_ATTR onPsocRxEdge()
{
    g_psoc_rx_edges++;
    g_psoc_rx_last_level = (uint8_t)digitalRead(PSOC_UART_RX);
}

static void logPsocUartDiag(const char *tag)
{
    const unsigned long bytes = (unsigned long)psoc.bytesRx();
    const unsigned long mark  = (unsigned long)psoc.markersRx();
    const unsigned long drop  = (unsigned long)psoc.syncDrops();
    const unsigned long badLn = (unsigned long)psoc.badLen();
    const unsigned long ping  = (unsigned long)psoc.pingsRx();
    const unsigned long diag  = (unsigned long)psoc.diagEventsRx();
    const int rxLevel = digitalRead(PSOC_UART_RX);
    uint32_t rxEdges;
    uint8_t rxEdgeLevel;

    noInterrupts();
    rxEdges = g_psoc_rx_edges;
    rxEdgeLevel = g_psoc_rx_last_level;
    interrupts();

    if (psoc.hasLastByte()) {
        SLAVE_LOG_PRINTF(
            "[SLAVE %d] %s bOK=%lu bBad=%lu uartBytes=%lu mark=%lu drop=%lu badLen=%lu ping=%lu diag=%lu rx=%d edge=%lu/%u last=0x%02X age=%lu txOK=%lu txFail=%lu state=%d fill=%u/%u\n",
            NODE_ID, tag,
            (unsigned long)psoc.batchesOK(), (unsigned long)psoc.batchesBad(),
            bytes, mark, drop, badLn, ping, diag, rxLevel,
            (unsigned long)rxEdges, (unsigned)rxEdgeLevel,
            psoc.lastByte(), (unsigned long)psoc.lastByteAgeMs(),
            (unsigned long)transport.sentOK(), (unsigned long)transport.sentFail(),
            (int)g_state, (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
    } else {
        SLAVE_LOG_PRINTF(
            "[SLAVE %d] %s bOK=%lu bBad=%lu uartBytes=%lu mark=%lu drop=%lu badLen=%lu ping=%lu diag=%lu rx=%d edge=%lu/%u last=none txOK=%lu txFail=%lu state=%d fill=%u/%u\n",
            NODE_ID, tag,
            (unsigned long)psoc.batchesOK(), (unsigned long)psoc.batchesBad(),
            bytes, mark, drop, badLn, ping, diag, rxLevel,
            (unsigned long)rxEdges, (unsigned)rxEdgeLevel,
            (unsigned long)transport.sentOK(), (unsigned long)transport.sentFail(),
            (int)g_state, (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
    }
}

static const char *psocDiagName(uint8_t event)
{
    switch (event) {
        case PSOC_EVT_BOOT:           return "BOOT";
        case PSOC_EVT_ANALOG_READY:   return "ANALOG_READY";
        case PSOC_EVT_CAL_START:      return "CAL_START";
        case PSOC_EVT_CAL_DONE:       return "CAL_DONE";
        case PSOC_EVT_CAL_BUSY:       return "CAL_BUSY";
        case PSOC_EVT_CAL_STAGE_DAC:  return "CAL_STAGE_DAC";
        case PSOC_EVT_CAL_STAGE_MEAS: return "CAL_STAGE_MEAS";
        case PSOC_EVT_CAL_STAGE_BEGIN:return "CAL_STAGE_BEGIN";
        case PSOC_EVT_CAL_STAGE_OK:   return "CAL_STAGE_OK";
        case PSOC_EVT_CAL_VERIFY_BEGIN:return "CAL_VERIFY_BEGIN";
        case PSOC_EVT_CAL_VERIFY_OK:  return "CAL_VERIFY_OK";
        case PSOC_EVT_CAL_AMUX_IN:    return "CAL_AMUX_IN";
        case PSOC_EVT_CAL_PROGRESS:   return "CAL_PROGRESS";
        case PSOC_EVT_CAL_WATCHDOG:   return "CAL_WATCHDOG";
        case PSOC_EVT_CAL_LP_BAD:     return "CAL_LP_BAD";
        case PSOC_EVT_CAL_STAGE_MEAS32: return "CAL_STAGE_MEAS32";
        case PSOC_EVT_SERVO_STAGE:    return "SERVO_STAGE";
        case PSOC_EVT_SERVO_STEP:     return "SERVO_STEP";
        case PSOC_EVT_WAIT_ESP:       return "WAIT_ESP";
        case PSOC_EVT_ESP_SEEN:       return "ESP_SEEN";
        case PSOC_EVT_CAL_LOOP:       return "CAL_LOOP";
        case PSOC_EVT_CAL_STAGE_SAT:  return "CAL_STAGE_SAT";
        case PSOC_EVT_CAL_STAGE_SAT_ALL: return "CAL_STAGE_SAT_ALL";
        case PSOC_EVT_CAL_REALCHECK_BEGIN: return "CAL_REALCHECK_BEGIN";
        case PSOC_EVT_CAL_REALCHECK_DAC: return "CAL_REALCHECK_DAC";
        case PSOC_EVT_CAL_REALCHECK_MEAS32: return "CAL_REALCHECK_MEAS32";
        case PSOC_EVT_CAL_REALCHECK_NUDGE: return "CAL_REALCHECK_NUDGE";
        case PSOC_EVT_CAL_REALCHECK_OK: return "CAL_REALCHECK_OK";
        case PSOC_EVT_CAL_STAGE_TARGET32: return "CAL_STAGE_TARGET32";
        case PSOC_EVT_CAL_SWEEP_DAC: return "CAL_SWEEP_DAC";
        case PSOC_EVT_CAL_SWEEP_MEAS32: return "CAL_SWEEP_MEAS32";
        case PSOC_EVT_ADC_SNAPSHOT_BEGIN: return "ADC_SNAPSHOT_BEGIN";
        case PSOC_EVT_ADC_RAW32: return "ADC_RAW32";
        case PSOC_EVT_ADC_FILT32: return "ADC_FILT32";
        case PSOC_EVT_RX_CMD:         return "RX_CMD";
        case PSOC_EVT_SETN:           return "SETN";
        case PSOC_EVT_ARMED:          return "ARMED";
        case PSOC_EVT_SYNC_RISE:      return "SYNC_RISE";
        case PSOC_EVT_SYNC_FALL:      return "SYNC_FALL";
        case PSOC_EVT_SAMPLING_START: return "SAMPLING_START";
        case PSOC_EVT_CAPTURE_DONE:   return "CAPTURE_DONE";
        case PSOC_EVT_DUMP_START:     return "DUMP_START";
        case PSOC_EVT_DUMP_DONE:      return "DUMP_DONE";
        case PSOC_EVT_START_NOW:      return "START_NOW";
        case PSOC_EVT_DEBUG_MODE:     return "DEBUG_MODE";
        case PSOC_EVT_STATUS_REQ:     return "STATUS_REQ";
        case PSOC_EVT_BUTTON:         return "BUTTON";
        case PSOC_EVT_BUTTON_IGNORED: return "BUTTON_IGNORED";
        case PSOC_EVT_CAPTURE_CLAMPED:return "CAPTURE_CLAMPED";
        case PSOC_EVT_CAL_PI_GAIN32:  return "CAL_PI_GAIN32";
        case PSOC_EVT_CAL_PI_DEADBAND:return "CAL_PI_DEADBAND";
        case PSOC_EVT_CAL_PI_ERROR32: return "CAL_PI_ERROR32";
        case PSOC_EVT_CAL_PI_BUCKET32:return "CAL_PI_BUCKET32";
        case PSOC_EVT_CAL_PI_STABLE:  return "CAL_PI_STABLE";
        case PSOC_EVT_CAL_AMUX_CAP:   return "CAL_AMUX_CAP";
        default:                      return "UNKNOWN";
    }
}

static const char *psocStateName(uint8_t state)
{
    switch (state) {
        case 0:  return "IDLE";
        case 1:  return "ARMED";
        case 2:  return "SAMPLING";
        case 3:  return "CALIBRATING";
        default: return "UNKNOWN";
    }
}

static uint8_t g_psoc_hw_class = 0xFFu;

static const char *psocHwName(uint8_t hwClass)
{
    switch (hwClass) {
        case 0:  return "GEO";
        case 1:  return "HAMMER";
        default: return "UNKNOWN";
    }
}

