simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
static void handleDebugNode(const MsgDebugNode *dbg)
{
    if (dbg->node_id != NODE_ID) return;
    bool enable = (dbg->enable != 0);
    debugEspSetRamp(enable);
    sendCfgAck(0xA7, 1);
    SLAVE_LOG_PRINTF("[SLAVE] debug_node=%d\n", (int)g_debug_mode);
}

#if defined(ESP8266)
static void onDataRecv(uint8_t *mac, uint8_t *data, uint8_t len)
#else
static void onDataRecv(const uint8_t *mac, const uint8_t *data, int len)
#endif
{
    (void)mac;
    if (len < 1) return;
    uint8_t cmd = data[0];
    if (g_state == SAMPLING && cmd != CMD_STOP) {
        /* En debug/test, VER puede interrumpir para evitar race condition */
        if (g_debug_mode && cmd == CMD_VIEW) {
            g_debug_mode = false;
            g_state = STOPPED;
        } else {
            return;   /* No ACK/radio durante muestreo real. */
        }
    }
    LOGM("RX", "cmd=0x%02X,len=%d,state=%d", cmd, len, (int)g_state);

    if (cmd == CMD_ARM &&
        (g_state == WAIT_ARM || g_state == ARMED || g_state == HOT_WAIT ||
         g_state == STOPPED || g_state == SAMPLING)) {
        g_debug_mode = false;   /* detener debug stream si estaba activo */
        g_state = ARMED;
        scheduleAutoCalibration(0u);
        MsgArmAck ack = { CMD_ARM_ACK, NODE_ID, 0 };
        espnowSend(MASTER_MAC, (const uint8_t *)&ack, sizeof(ack));
        SLAVE_LOG_PRINTLN("[SLAVE] ARMED");
    }
    else if (cmd == CMD_PRESTART && len >= (int)sizeof(MsgPrestart) &&
             g_state != SAMPLING) {
        if (!g_auto_cal_requested && g_auto_cal_due_ms != 0u) {
            serviceAutoCalibration();
        }
        if (g_cfg_waiting && g_cfg_sub_cmd == PSOC_CMD_CALIBRATE) {
            SLAVE_LOG_PRINTLN("[SLAVE] PRESTART deferred: calibration busy");
            LOGM("PRESTART_DEFER", "reason=cal_busy,state=%d", (int)g_state);
            return;
        }
        if (!g_auto_cal_requested && g_auto_cal_due_ms != 0u) {
            /* START takes priority over a scheduled-but-not-started auto-cal.
               Cancel it so we don't block capture. User can manually calibrate. */
            SLAVE_LOG_PRINTLN("[SLAVE] PRESTART: override pending auto-cal");
            LOGM("PRESTART_OVERRIDE_AUTOCAL", "state=%d", (int)g_state);
            g_auto_cal_due_ms = 0u;
        }
        const MsgPrestart *msg = (const MsgPrestart *)data;
        enterHotWait(msg->n_batches);
    }
    else if (cmd == CMD_HOTWAIT_QUERY && len >= (int)sizeof(MsgHotWaitQuery)) {
        const MsgHotWaitQuery *msg = (const MsgHotWaitQuery *)data;
        if (msg->node_id == NODE_ID) {
            sendHotWaitAck();
        }
    }
    else if (cmd == CMD_SCOPE_START && len >= (int)sizeof(MsgScopeStart)) {
        if (g_state == HOT_WAIT && storeReadyForHotWait()) {
            debugEspHardwareStartPulse();
            digitalWrite(SYNC_TO_PSOC_PIN, LOW);
            SLAVE_LOG_PRINTLN("[SLAVE] SCOPE_START");
        } else {
            SLAVE_LOG_PRINTF("[SLAVE] SCOPE_START ignored state=%d ready=%u\n",
                             (int)g_state, (unsigned)storeReadyForHotWait());
        }
    }
    else if (cmd == CMD_START && len >= (int)sizeof(MsgStart)) {
        const MsgStart *msg = (const MsgStart *)data;
        uint8_t targetNode = msg->target_node & 0x7Fu;
        bool probeOnly = (msg->target_node & 0x80u) != 0;
        if (targetNode != 0 && targetNode != NODE_ID) return;

        uint32_t nowUs = (uint32_t)micros();
        uint32_t startToken = (uint32_t)msg->t_start_us;
        if (probeOnly) {
            sendStartAck((g_state == HOT_WAIT && storeReadyForHotWait()) ? 2 : 0,
                         startToken, nowUs);
            SLAVE_LOG_PRINTF("[SLAVE] START probe token=%u state=%d\n",
                             (unsigned)startToken, (int)g_state);
            return;
        }
        if (g_state == SAMPLING) {
            SLAVE_LOG_PRINTF("[SLAVE] START already sampling token=%u (no RF ack)\n",
                             (unsigned)startToken);
            return;
        }
        bool startAllowed = (g_state == HOT_WAIT && storeReadyForHotWait());
        if (!startAllowed) {
            sendStartAck(0, startToken, nowUs);
            SLAVE_LOG_PRINTF("[SLAVE] START ignored state=%d ready=%u\n",
                             (int)g_state, (unsigned)storeReadyForHotWait());
            return;
        }
        int syncBefore = digitalRead(SYNC_TO_PSOC_PIN);
        digitalWrite(SYNC_TO_PSOC_PIN, HIGH);
        int syncAfter = digitalRead(SYNC_TO_PSOC_PIN);
        /* No START_ACK here: once SYNC rises the PSoC is measuring, so RF stays
           silent until the store is full and CMD_START ok=2 can be sent. */
        g_t_start_us    = msg->t_start_us;
        g_store_fill    = 0;   /* reset store index para nueva grabación */
        g_debug_count   = 0;
        g_debug_last_us = nowUs;
        g_sampling_start_ms = millis();
        g_sampling_start_psoc_bytes = psoc.bytesRx();
        g_sampling_start_batches_ok = psoc.batchesOK();
        g_start_store_active = (g_rec_n_batches > 0 && g_store_buf != nullptr && !g_view_store_active);
        g_start_fallback_sent = false;
        g_state = SAMPLING;
        SLAVE_LOG_PRINTF("[SLAVE] START_OK target=%u token=%u sync=%d->%d bytes=%lu fill=%u/%u view=%u start=%u\n",
                         (unsigned)targetNode, (unsigned)startToken,
                         syncBefore, syncAfter,
                         (unsigned long)g_sampling_start_psoc_bytes,
                         (unsigned)g_store_fill, (unsigned)g_rec_n_batches,
                         (unsigned)g_view_store_active, (unsigned)g_start_store_active);
        LOGM("START_OK", "token=%u,target=%u,n_batches=%u,store=%d,sync=%d->%d,view=%u,start=%u",
             (unsigned)startToken, (unsigned)targetNode,
             (unsigned)g_rec_n_batches, (int)(g_store_buf != nullptr),
             syncBefore, syncAfter, (unsigned)g_view_store_active,
             (unsigned)g_start_store_active);
    }
    else if (cmd == CMD_STOP) {
        digitalWrite(SYNC_TO_PSOC_PIN, LOW);
        g_debug_mode = false;
        if (g_view_remaining > 0) {
            g_view_remaining = 0;
        }
        psoc.debugRamp(false);      /* por seguridad: cortar cualquier debug PSoC */
        g_view_store_active = false;
        g_start_store_active = false;
        g_start_fallback_sent = false;
        g_state = STOPPED;
        SLAVE_LOG_PRINTLN("[SLAVE] STOP");
    }
    else if (cmd == CMD_DEBUG && len >= (int)sizeof(MsgDebug)) {
        const MsgDebug *d = (const MsgDebug *)data;
        bool enable = (d->enable != 0);
        debugEspSetRamp(enable);
        MsgArmAck ack = { CMD_ARM_ACK, NODE_ID, (uint8_t)(g_debug_mode ? 0xDD : 0x00) };
        espnowSend(MASTER_MAC, (const uint8_t *)&ack, sizeof(ack));
        SLAVE_LOG_PRINTF("[SLAVE] debug=%d\n", (int)g_debug_mode);
    }
    else if (cmd == CMD_SET_CONFIG && len >= (int)sizeof(MsgSetConfig)) {
        handleSetConfig((const MsgSetConfig *)data);
    }
    else if (cmd == CMD_DEBUG_NODE && len >= (int)sizeof(MsgDebugNode)) {
        handleDebugNode((const MsgDebugNode *)data);
    }
    else if (cmd == CMD_VIEW && len >= (int)sizeof(MsgView)) {
        /* "Ver": igual que PRESTART en el flujo START.
         * El esclavo entra en HOT_WAIT y espera CMD_START del maestro
         * (el maestro hace HOTWAIT_QUERY → START dirigido a este nodo).
         * Sin auto-arme: todo el muestreo empieza solo cuando el maestro
         * confirma que no hay RF pendiente, igual que en START normal. */
        const MsgView *msg = (const MsgView *)data;
        if (msg->node_id != NODE_ID) return;
        uint16_t n = msg->n ? msg->n : 1;
        if (!g_psocConnected) {
            SLAVE_LOG_PRINTF("[SLAVE] VIEW: PSoC aun sin HELLO, intento igual\n");
            LOGM("VIEW_WARN", "psoc=0");
        }
        digitalWrite(SYNC_TO_PSOC_PIN, LOW);
        g_debug_mode = false;
        psoc.debugRamp(false);
        enterHotWait(n);
        g_start_store_active = false;
        uint8_t ok = storeReadyForHotWait() ? 1u : 0u;
        if (ok) {
            g_view_store_active = true;
        } else {
            g_view_store_active = false;
            g_start_store_active = false;
            g_state = STOPPED;
        }
        sendCfgAck(CMD_VIEW, ok);
        SLAVE_LOG_PRINTF("[SLAVE] VIEW n=%u HOT_WAIT ok=%u (esperando CMD_START)\n", n, ok);
        LOGM("VIEW", "n=%u,store=1,hotwait=1,ok=%u", n, ok);
    }
    else if (cmd == CMD_DEBUG_PSOC && len >= (int)sizeof(MsgDebugPsoc)) {
        const MsgDebugPsoc *msg = (const MsgDebugPsoc *)data;
        if (msg->node_id != NODE_ID) return;
        psoc.debugRamp(msg->enable != 0);
        sendCfgAck(CMD_DEBUG_PSOC, 1);
        SLAVE_LOG_PRINTF("[SLAVE] DEBUG_PSOC=%u\n", msg->enable);
        LOGM("DBGPSOC", "en=%u", msg->enable);
    }
    else if (cmd == CMD_SET_RECLEN && len >= (int)sizeof(MsgSetRecLen)) {
        const MsgSetRecLen *msg = (const MsgSetRecLen *)data;
        allocStore(msg->n_batches);
        /* Confirmar al maestro que el buffer está listo */
        MsgCfgAck ack = { CMD_CFG_ACK, NODE_ID, CMD_SET_RECLEN,
                          (uint8_t)((msg->n_batches == 0 || storeReadyForHotWait()) ? 1 : 0) };
        espnowSend(MASTER_MAC, (const uint8_t *)&ack, sizeof(ack));
    }
    else if (cmd == CMD_REQ_BATCH && len >= (int)sizeof(MsgReqBatch)) {
        handleReqBatch((const MsgReqBatch *)data);
    }
    else if (cmd == CMD_BLINK_LED && len >= (int)sizeof(MsgBlinkLed)) {
        const MsgBlinkLed *msg = (const MsgBlinkLed *)data;
        if (msg->node_id != 0u && msg->node_id != NODE_ID) return;
        /* El LED de identificación vive en el PSoC: reenviamos el comando por
         * UART. El PSoC titila su LED (no bloqueante, vía su Timer). Igual
         * confirmamos al maestro para que la web muestre el ACK. */
        psoc.blinkLed();
        sendCfgAck(CMD_BLINK_LED, 1);
        SLAVE_LOG_PRINTF("[SLAVE] BLINK_LED -> PSoC node=%u\n", NODE_ID);
        LOGM("BLINK_LED", "node=%u,target=psoc", NODE_ID);
    }
}
/* SaveEEPROM (0xB6) y SelectStream (0xB7) llegan por CMD_SET_CONFIG → handleSetConfig */

/* ── Store-and-forward helpers ───────────────────────────────────────────── */

static void allocStore(uint16_t n_batches)
{
    n_batches = clampPsocCaptureBatches(n_batches);
    free(g_store_buf);  free(g_store_ts_us);
    g_store_buf    = nullptr;
    g_store_ts_us  = nullptr;
    g_store_fill   = 0;
    g_rec_n_batches= n_batches;
    if (n_batches == 0) return;
    g_store_buf   = (SampleBytes *)malloc((size_t)n_batches * SPI_BATCH_SAMPLES * sizeof(SampleBytes));
    g_store_ts_us = (uint32_t    *)malloc((size_t)n_batches * sizeof(uint32_t));
    if (!g_store_buf || !g_store_ts_us) {
        free(g_store_buf);
        free(g_store_ts_us);
        g_store_buf = nullptr;
        g_store_ts_us = nullptr;
    }
    SLAVE_LOG_PRINTF("[SLAVE] store alloc n=%u buf=%s\n",
                     n_batches, storeReadyForHotWait() ? "OK" : "FAIL");
}

static void handleReqBatch(const MsgReqBatch *msg)
{
    if (msg->node_id != NODE_ID) return;
    uint16_t seq = msg->batch_seq;
    if (g_state == SAMPLING) {
        return;   /* No TX ESP-NOW mientras el ADC está capturando. */
    }
    if ((g_view_store_active || g_start_store_active) && g_store_fill < g_rec_n_batches) {
        SLAVE_LOG_PRINTF("[SLAVE] REQ_BATCH ignored during capture seq=%u fill=%u/%u state=%d\n",
                         seq, g_store_fill, g_rec_n_batches, (int)g_state);
        return;
    }
    if (seq >= g_store_fill || !g_store_buf) {
        /* Batch fuera de rango: notificar al master para que avance sin esperar timeout */
        MsgCfgAck nack = { CMD_CFG_ACK, NODE_ID, CMD_REQ_BATCH, 0 };
        espnowSend(MASTER_MAC, (const uint8_t *)&nack, sizeof(nack));
        SLAVE_LOG_PRINTF("[SLAVE] REQ_BATCH NACK seq=%u fill=%u\n", seq, g_store_fill);
        return;
    }
    const SampleBytes *s  = &g_store_buf[(size_t)seq * SPI_BATCH_SAMPLES];
    uint64_t           ts = g_t_start_us + (uint64_t)g_store_ts_us[seq];
    transport.sendStoredBatch(s, seq, ts, NODE_ID);
}

